# Parameter Type Id Array Type Parameter Property

Source: https://www.revitapidocs.com/2026/8a262d0d-62cd-a3f0-c487-6b5ca14f7a74.htm

---

| Parameter Type Id Array Type Parameter Property |
| --- |

"Type"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayTypeParameter { get; }
```

```
Public Shared ReadOnly Property ArrayTypeParameter As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayTypeParameter {
	ForgeTypeId^ get ();
}
```

```
static member ArrayTypeParameter : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace